# 1. ดึงเครื่องมือสร้างเว็บ (streamlit) เข้ามาในโปรแกรม
import streamlit as st

# 2. คำสั่งสำหรับตั้งชื่อหัวข้อใหญ่บนหน้าเว็บ
st.title("❤ ระบบประเมิณความเสี่ยงภาวะหัวใจเต้นผิดจังหวะ")

# 3. สร้างช่องกรอกตัวเลขช่องแรก (อายุ)
age = st.number_input(label="กรุณากรอกอายุของคุณ (ปี)" , min_value=1 , max_value=120 , value=30 )

# 4. สร้างช่องกรอกตัวเลขช่อง2 (น้ำหนัก-ส่วนสูง)
weight = st.number_input(label="กรุณากรอกน้ำหนักของคุณ (กก.)" , min_value=1.0 , max_value=200.0 , value=60.0 )
height = st.number_input(label="กรุณากรอกส่วนสูงของคุณ (ซม.)" , min_value=50.0 , max_value=250.0 , value=165.0 )

# 5. ดัชนีมวลกาย(ฺBMI)
# 1. แปลงส่วนสูงจาก เซนติเมตร เป็น เมตร
height_m = height / 100
# 2. คำนวณค่า BMI ตามสูตร (เครื่องหมาย ** 2 หมายถึง ยกกำลังสอง)
BMI = weight / (height_m ** 2)
# 3. สั่งให้เปิดกล่องสีฟ้า (info) เพื่อโชว์ค่า BMI ที่คำนวณได้อัตโนมัติ โดยตัดทศนิยมให้เหลือ 1 ตำแหน่ง
st.info(f"ดัชนีมวลกาย (BMI) (auto-calculate): {BMI:.1f}")

# 1. ช่องกรอกความดันโลหิต (mmHg) รับเป็นตัวเลขจำนวนเต็ม
bp = st.number_input(label="ความดันโลหิต (mmHg) *ตัวเลขบน*" , min_value=50 , max_value=200 , value=120 )
resting_hr = st.number_input(label="อัตราการเต้นของหัวใจขณะพัก (bpm)" , min_value=30 , max_value=200 , value=75)
family_history = st.selectbox(label="ประวัติครอบครัว (มี/ไม่มีโรคหัวใจ)" , options=[ "ไม่มี" , "มี"])

# 1. สร้างปุ่ม "ประมวลผล" ถ้าผู้ใช้กดปุ่มนี้ โค้ดที่อยู่ด้านใน (ที่เยื้องเข้าไป) จะทำงาน
if st.button(label="ประมวลผล" , use_container_width=True):

#2.ตั้งต้นคะแนนความเสี่ยงไปที่ 10%
    risk_prob = 10.0

#3. เช็กเงื่อนไขอายุ: ถ้าอายุเกิน 50 ปี บวกความเสี่ยงเพิ่ม 15% / ถ้าเกิน 40 ปี บวก 5%
    if age > 50:    
        risk_prob += 15
    elif age > 40:
        risk_prob += 5

#4. เช็กเงื่อนไข BMI : ถ้าอ้วน (BMI ตั้งแต่ 25 ขึ้นไป) บวกความเสี่ยงเพิ่ม 10%
    if BMI >= 25:
        risk_prob += 10

#5. เช็กเงื่อนไขความดันโลหิต: ถ้าความดันสูง (ตั้งแต่ 140 ขึ้นไป) บวก 15% / ถ้าเริ่มสูง (ตั้งแต่ 130 ขึ้นไป) บวก 5%
    if bp >= 140:
        risk_prob += 15
    elif bp >= 130:
        risk_prob += 5

#6. เช็คอัตราการเต้นหัวใจ: ถ้าเต้นเร็วเกิน 100 หรือช้ากว่า 60 ครั้ง/นาที (ผิดปกติ) บวก 15%
    if resting_hr > 100 or resting_hr < 60:
        risk_prob += 15

#7. เช็กประวัติครอบครัว: ถ้ามีคนในครอบครัวเป็นโรคหัวใจ บวกเพิ่ม 20%
    if family_history == "มี":
        risk_prob += 20

#8. กฏเหล็กคณิตศาสตร์: ความเสี่ยงไม่เกิน 100% (คำสั่ง min จะเลือกค่าที่น้อยที่สุด)
        risk_prob = min(risk_prob , 100.0)

#1. จัดกลุ่มเพื่อระบุข้อความระดับความเสี่ยงตามคะแนนที่คำนวณได้
    if risk_prob < 30:
        risk_level = "ต่ำ , (Low)"
    elif risk_prob <= 60:
        risk_level = "ปานกลาง , (Medium)"
    else:
        risk_level = "สูง , (High)"

#2. แสดงตัวหนังสือสรุปผลลัพธ์บนเว็บ
    st.write("___")
    st.header("📊 สรุปผลการประเมิน")
    st.metric(label="ระดับความเสี่ยงของคุณ" , value=risk_level)
    st.markdown(f"*** โอกาสเกิดภาวะเสี่ยง: , {risk_prob:2f}%")

#3. นำเข้าเครื่องมือกราฟ Plotly (เครื่องมือนี้จะแถมมากับ Streamlit อยู่แล้ว)
    import plotly.graph_objects as go

#4. วาดโครงสร้างกราฟรูปหน้าปัดเกจชี้ระดับสี
    fig = go.Figure(go.Indicator(
        mode = "gauge+number", # แสดงทั้งหน้าปัดและตัวเลขเปอร์เซ็นต์
        value = risk_prob,
        domain = {'x': [0 , 1] , 'y': [0 , 1]},
        title = {'text': "กราฟแสดงระดับความเสี่ยง"},
        gauge = {'axis': {'range': [None , 100]}, # หน้าปัดยาวตั้งแต่ 0 ถึง 100%
    'steps': [
        {'range': [0, 30], 'color': "lightgreen"}, # 0-30% สีเขียว (เสี่ยงต่ำ)
        {'range': [30, 60], 'color': "orange"}, # 30-60% สีส้ม (เสี่ยงปานกลาง)
        {'range': [60, 100], 'color': "red"}] # 60-100% สีแดง (เสี่ยงสูง)
    }
    ))

#5. สั่งอัปโหลดกราฟขึ้นไปโชว์บนหน้าเว็บ
    st.plotly_chart(fig, use_container_width=True)